# ComboBoxDropDownOpenedEventArgs Properties

---
The ComboBoxDropDownOpenedEventArgs type exposes the following members.
| Name| Description
---|---|---
| Application|  The current UIApplication. (Inherited from RibbonItemEventArgs)
Top
#### Reference
ComboBoxDropDownOpenedEventArgs Class
Autodesk.Revit.UI.Events Namespace